---
kind: other
id: Methods.T:Autodesk.Revit.DB.Infrastructure.Alignment
source: html/ce9d3d9d-78ce-5365-2dc1-e2fd2f586658.htm
---
# Alignment Methods

Returns an Alignment object given a Revit alignment element.